<?php

return [
  'heading' => 'สถิติการดูหน้าเว็บไซต์',
  'description' => 'หน้านี้ประกอบด้วยข้อมูลการวิเคราะห์พื้นฐาน (ทั้งที่เก็บไว้และแสดงโดยไม่มีการระบุข้อมูลส่วนบุคคล) สำหรับจำนวนการเข้าชมหน้าทั้งหมดในแอปในช่วง 30 วันที่ผ่านมา',
  'collectionMethod' => 'ข้อมูลถูกเก็บรวบรวมไว้ที่เซิร์ฟเวอร์ โดยอาศัยการตอบกลับจากชุดหน้าเว็บที่ถูกจำกัดไว้ จำนวนครั้งที่หน้าเว็บถูกดูจะถูกบันทึกไว้เป็นรายบุคคล แต่จะถูกรวบรวมเป็นรายวันทั้งหมดโดยระบบเบื้องหลังในเซิร์ฟเวอร์',
  'lastUpdated' => 'ข้อมูลบนหน้านี้ถูกเก็บไว้ชั่วคราวเพื่อลดภาระของเซิร์ฟเวอร์ ข้อมูลที่คุณเห็นได้รับการอัปเดตครั้งล่าสุดเมื่อ<1/>',
  'charts' => [
    'dailyTotal' => 'จำนวนการเข้าชมหน้าทั้งหมดต่อวัน',
    'breakdown' => 'แยกรายการยอดการดูหน้าเว็บ',
    'byPage' => 'แยกตามหน้า',
    'byLanguage' => 'แยกด้วยภาษา',
  ],
  'values' => [
    'unknown' => 'ไม่ทราบ',
  ],
];
