<?php

return [
  'seoDescription' => 'สร้างตัวบอกเวลาสำหรับข้อความแชทใน Discord',
  'changeLanguage' => 'เปลี่ยนภาษา',
  "notFound" => [
    "heading" => "ไม่พบหน้า",
    "content" => "ไม่มีอะไรให้ดูที่นี่",
  ],
  "maintenanceMode" => [
    "heading" => "โหมดการบำรุงรักษา",
    "content" => [
      'pleaseWait' => "แอปพลิเคชันกำลังอยู่ในระหว่างการอัปเดต กรุณาลองใหม่อีกครั้งในไม่กี่วินาที",
      'joinSupportServer' => "ถ้ายังมีปัญหาอยู่มากกว่า 5 นาที กรุณาควรเข้าร่วมเซิร์ฟเวอร์ Discord และแจ้งให้พวกเราทราบ",
      'contactDeveloper' => "ถ้ายังมีปัญหาอยู่มากกว่า 5 นาที กรุณาควรแจ้งผู้พัฒนาเว็บไซต์และแจ้งให้พวกเขารู้",
    ],
    "supportServerButton" => "เซิร์ฟเวอร์สนับสนุน",
  ],
  'incompleteTranslations' => 'ภาษานี้ยังมีการแปลภาษาไม่สมบูรณ์',
  'contributeTranslations' => 'สนับสนุน',
  'copyToClipboard' => 'คัดลอกไปยังคลิปบอร์ด',
  'copiedToClipboard' => 'คัดลอกไปยังคลิปบอร์ดแล้ว!',
  'jsDisabled' => [
    'title' => 'เว็บไซต์นี้จำเป็นต้องใช้ JavaScript',
    'body' => "เบราว์เซอร์ของคุณอาจจะไม่รองรับ JavaScript หรือ JavaScript ถูกปิดอยู่ตอนนี้ บางเบราว์เซอร์ปิดการใช้ JavaScript โดยเริ่มต้นเพราะเหตุผลของความปลอดภัยแต่เว็บไซต์นี้จำเป็นที่จะใช้ JavaScript โปรดกรุณาเปิด JavaScript, รีเฟรชเว็บไซต์และลองอีกครั้งหรือใช้เบราว์เซอร์อื่นแทน",
  ],
  'nav' => [
    'botSettings' => 'การตั้งค่าแอปพลิเคชั่น',
    'profile' => 'โปรไฟล์',
    'legal' => 'ข้อมูลทางกฎหมาย',
  ],
  'sidebar' => [
    'inputSettings' => [
      'title' => 'การตั้งค่าการป้อนข้อมูล',
      'naturalLanguageInput' => [
        'label' => 'อนุญาตให้ป้อนข้อมูลใน @time',
        'description' => 'อนุญาตให้จัดการกับเวลาที่เลือกไว้ด้วยภาษาธรรมชาติ (เช่น "ใน 5 ชั่วโมง") ผ่านช่องป้อนข้อความเพิ่มเติม คล้ายกับแท็ก @time ใหม่ใน Discord รองรับเพียงจำนวนภาษาที่จำกัดเท่านั้น',
      ],
      'customDateInput' => [
        'label' => 'การป้อนวันที่แบบกำหนดเอง',
        'description' => "เปลี่ยนวันที่เริ่มต้นจากเบราว์เซอร์ให้เป็นสิ่งที่คุณกำหนดเอง",
      ],
      'customTimeInput' => [
        'label' => 'การป้อนเวลาแบบกำหนดเอง',
        'description' => "เปลี่ยนเวลาเริ่มต้นของเบราว์เซอร์ให้เป็นสิ่งที่คุณกำหนดเอง มันสามารถช่วยได้ถ้าคุณมีปัญหาในการเลือกเวลาบนเบราว์เซอร์มือถือ",
      ],
      'separateInputs' => [
        'label' => 'แยกอินพุต',
        'description' => "แสดงอินพุตแยกเป็นวันและเวลาแทนที่จะรวมเป็นหนึ่ง (บางเบราเซอร์อาจไม่รองรับฟีเจอร์นี้)",
      ],
      'flatUi' => [
        'label' => 'อินเทอร์เฟซแบบเรียบง่าย',
        'description' => "ปิดการใช้งานเอฟเฟกต์เงาและความสูงบนช่องข้อความและปุ่ม",
      ],
      'hourCycle' => [
        'label' => 'กำหนดประเภทของนาฬิกาสำหรับการป้อนเวลา',
        'description' => 'เปลี่ยนวิธีการแสดงชั่วโมงในช่องป้อนเวลาแบบกำหนด ไม่มีผลต่อการแสดงตัวอย่างในผลลัพธ์ตัวอย่าง',
        'options' => [
          'default' => 'ตามภาษาที่กำหนดไว้',
          'h12' => '12 ชั่วโมง',
          'h24' => '24 ชั่วโมง',
        ],
      ],
      'firstDayOfWeek' => [
        'label' => 'First day of the week',
        'description' => 'Change which day should be considered the first day of the week in the calendar of the custom date input.',
        'options' => [
          'default' => 'Language default',
        ],
      ],
      'advancedSettings' => 'Advanced input settings',
    ],
    'timeSync' => [
      'title' => 'การทำให้ข้อมูลตรงกัน',
      'status' => [
        'syncing' => 'นาฬิกาของคุณกำลังซิงค์กับเซิร์ฟเวอร์ของเรา โปรดรอสักครู่',
        'accurate' => 'ระบบนาฬิกาของคุณถูกต้อง',
        'potentiallyWrong' => 'นาฬิกาในระบบคุณอาจไม่ถูกต้อง',
        'value' => 'ความแตกต่างระหว่างเวลาท้องถิ่นและเวลาเซิร์ฟเวอร์คือ:offset',
      ],
      'autoTimeSync' => [
        'label' => 'ใช้ค่าชดเชยเวลาของเซิร์ฟเวอร์ในการคำนวณ (เวอร์ชันทดลอง)',
        'description' => 'หากนาฬิกาในระบบของคุณคลาดเคลื่อนจากเวลาเซิร์ฟเวอร์มากกว่า :offset (ไม่รวมความแตกต่างของเขตเวลา) การคำนวณเวลาในบางส่วนจะถูกปรับให้คำนึงถึงความคลาดเคลื่อนนี้ เพื่อช่วยลดโอกาสที่ค่าตราประทับเวลาจะแสดงไม่ถูกต้อง
<1>นี่เป็นฟีเจอร์ทดลอง โปรดใช้ด้วยความระมัดระวัง!</1>
การซิงค์จะเกิดขึ้นเมื่อหน้าเพจถูกโหลดครั้งแรก และทันทีหลังจากที่เปิดใช้งานการตั้งค่านี้',
      ],
      'details' => 'รายละเอียด',
      'autoApplyCheckbox' => 'ใช้ค่าชดเชยเวลาที่คำนวณได้กับไลบรารี วันและเวลา เมื่อกดปุ่ม :syncButtonLabel ด้วยตนเอง (จะมีผลเฉพาะเมื่อค่าความแตกต่างมากกว่าค่าขีดจำกัด :ค่าชดเชย เท่านั้น)',
      'syncButtonLabel' => 'ซิงโครไนซ์',
      'resetOffsetButtonLabel' => 'รีเซ็ตค่าชดเชยที่ได้ตั้งไว้',
      'roundTripDuration' => 'ระยะเวลาการเดินทางไปกลับ',
      't0' => 'เวลาตราประทับของไคลเอนต์ขณะส่งคำขอ',
      't1' => 'เวลาตราประทับของเซิร์ฟเวอร์ขณะรับคำขอ',
      't2' => 'เวลาตราประทับของเซิร์ฟเวอร์ขณะส่งการตอบกลับ',
      't3' => 'เวลาตราประทับของไคลเอนต์ขณะรับการตอบกลับ',
      'dtlOffsetCell' => 'ค่าชดเชยการคำนวณที่กำลังใช้งานอยู่',
      'timestampValue' => ':value วินาที',
      'offsetAmount' => ':offset มิลลิวินาที',
      'networkOffsetCell' => 'ตรวจพบการคลาดเคลื่อนของเวลา (ผ่านเครือข่าย)',
    ],
    'localSettings' => [
      'title' => 'การตั้งค่าเฉพาะบุคคล',
    ],
    'credits' => [
      'title' => 'เครดิต',
      'developedBy' => 'สร้างโดย <1></1>',
      'using' => 'ได้ใช้ <1></1>',
      'fontAwesomeFree' => 'เวอร์ชันฟรีของชุดไอคอนและฟอนต์',
      'laravel' => 'Laravel',
      'vueJs' => 'Vue.js',
      'dateFns' => 'date-fns',
      'vueTippy' => 'VueTippy',
      'chrono' => 'chrono',
      'translatedBy' => 'แปลโดย <1></1>',
      'openSourceSoftware' => 'ซอฟต์แวร์แบบโอเพ่นซอร์ส',
      'viewSourceCode' => 'ดูรหัสต้นฉบับ',
      'notAffiliated' => 'เว็บไซต์ไม่ได้สร้างหรือเกี่ยวข้องกับ Discord แต่อย่างใด',
    ],
    'themeButton' => [
      'dark' => 'ธีมมืด',
      'light' => 'ธีมสว่าง',
      'system' => 'ใช้ธีมของระบบ',
    ],
  ],
  'designEditor' => [
    'title' => 'ตัวแก้ไขการออกแบบ',
    'description' => 'คุณสามารถปรับเปลี่ยนลักษณะต่างๆ ของเว็บไซต์ได้โดยใช้ข้อมูลอินพุตในตารางด้านล่าง ชื่อตัวแปรจะอิงตามตัวระบุในโค้ด ดังนั้นจึงไม่สามารถแปลได้ ค่าต่างๆ จะถูกรีเซ็ตเมื่อรีเฟรชหน้าต่างนี้',
    'designPageLink' => 'หน้าการออกแบบ',
    'exportInfo' => 'คุณสามารถส่งออกการเปลี่ยนแปลงของคุณไปยังไฟล์รูปแบบ UserStyle ซึ่งสามารถใช้ร่วมกับส่วนขยาย เช่น <1>Stylus</1> เพื่อปรับแต่งรูปลักษณ์ของแอปอย่างถาวร อย่างไรก็ตาม โปรดทราบว่าตัวแปรเหล่านี้อาจเปลี่ยนแปลงได้ตลอดเวลา ดังนั้นคุณจะต้องอัปเดตรูปแบบที่กำหนดเองด้วยตนเอง',
    'export' => 'ส่งออกแบบUserStyle',
    'variableColumnHeader' => 'ตัวแปร CSS',
    'valueColumnHeader' => 'ค่า',
  ],
];
