<?php

return [
  'title' => 'โปรไฟล์',
  'intro' => 'หน้าโปรไฟล์ช่วยให้คุณจัดการข้อมูลบัญชีของคุณที่เกี่ยวข้องกับเว็บไซต์โดยเฉพาะ
หากคุณต้องการเปลี่ยนค่าพื้นฐานหรือการตั้งค่าอื่น ๆ สำหรับแอป Discord โปรดไปที่หน้า <1>การตั้งค่าแอป</1>',
  'information' => [
    'heading' => 'ข้อมูลโปรไฟล์',
    'description' => "อัปเดตข้อมูลโปรไฟล์บัญชีของคุณ",
    'displayName' => 'ชื่อที่ใช้แสดง',
    'hiddenFormats' => 'รูปแบบเวลาต่างๆ ที่ถูกซ่อนจากตารางตัวอย่าง',
    'saveSuccess' => 'โปรไฟล์ของคุณได้รับการอัปเดตเรียบร้อยแล้ว',
  ],
  'accounts' => [
    'heading' => 'บัญชีที่เชื่อมต่อ',
    'description' => 'คุณสามารถเชื่อมโยงบัญชีหลายบัญชีเข้ากับบัญชี HammerTime ของคุณได้เพื่อให้สามารถจัดการได้ในที่เดียว ข้อมูลผู้ใช้พื้นฐานที่แสดงไว้ที่นี่จะได้รับการอัปเดตโดยอัตโนมัติอย่างน้อยที่สุดหนึ่งครั้งต่อชั่วโมงเมื่อคุณโหลดหน้านี้',
    'discord' => 'บัญชี Discord',
    'crowdin' => 'บัญชี Crowdin',
    'noConnectedAccounts' => 'ขณะนี้คุณยังไม่มีบัญชีที่เชื่อมต่ออยู่',
    'linkAdditional' => [
      'heading' => 'เชื่อมโยงบัญชีเพิ่มเติม',
      'description' => 'ใช้ปุ่มด้านล่างเพื่อเชื่อมต่อบัญชีเพิ่มเติมกับบัญชี HammerTime ของคุณ',
      'discord' => [
        'description' => 'หากรูปโปรไฟล์หรือชื่อที่แสดงของคุณมีการเปลี่ยนแปลง คุณสามารถใช้ฟังก์ชันนี้เพื่ออัปเดตข้อมูลนั้นให้กับบัญชี Discord ใด ๆ ที่เชื่อมโยงไว้แล้วได้เช่นกัน',
        'authorize' => 'อนุญาตบัญชี Discord',
      ],
      'crowdin' => [
        'description' => 'หากคุณเป็นผู้แปลสำหรับโปรเจ็กต์นี้ การเชื่อมโยงบัญชี Crowdin ของคุณจะช่วยให้คุณสามารถปรับแต่งชื่อของคุณในส่วนเครดิตของการแปลในเครดิตและยังทำหน้าที่เป็นระดับการยืนยันเพิ่มเติม เพื่อยืนยันว่าบัญชีเหล่านี้เป็นของคุณจริง หากคุณเข้าร่วมเซิร์ฟเวอร์ Discord ของโปรเจ็กต์',
        'authorize' => 'อนุญาตบัญชี Crowdin',
      ],
    ],
  ],
  'creditOverrides' => [
    'heading' => 'เครดิตการแปล:',
    'description' => 'ปรับแต่งวิธีที่ชื่อของคุณปรากฏในเครดิตการแปลสำหรับแต่ละภาษาที่คุณเป็นผู้มีส่วนร่วม',
    'displayName' => 'ชื่อที่แสดง',
    'avatarProvider' => 'รูปโปรไฟล์',
    'avatarProviders' => [
        'discord' => 'Discord',
        'gravatar' => 'Gravatar',
        'crowdin' => 'Crowdin',
    ],
    'gravatarEmail' => 'อีเมล',
    'gravatarDescription' => '<1>Gravatar</1>ช่วยให้คุณใช้รูปประจำตัวเดียวกันบนเว็บไซต์หลายแห่งที่รองรับบริการนี้ อีเมลของคุณจะถูกบันทึกเป็นรหัสแฮช MD5',
    'avatarAccount' => 'บัญชี',
    'url' => 'ลิงค์',
    'visibility' => 'การเปิดเผย',
    'submit' => 'ส่งเพื่อขออนุมัติ',
    'saveSuccess' => 'ได้ส่งเพื่อขออนุมัติแล้ว',
    'saveHideSuccess' => 'ได้เปลี่ยนการมองเห็นแล้ว',
    'cancel' => 'ยกเลิกการเปลี่ยนแปลง',
    'statusPrefix' => 'สถานะ',
    'status' => [
      'approved' => 'ได้รับการอนุมัติ',
      'inReview' => 'กำลังตรวจสอบ',
      'rejected' => 'ถูกปฏิเสธ',
    ],
    'currentlyApproved' => 'ค่าที่ได้รับการอนุมัติ ณ ตอนนี้',
    'reApprovalWarning' => 'การเปลี่ยนแปลงใดๆ นอกเหนือจากการตั้งค่าการมองเห็น จะต้องได้รับการตรวจสอบโดยเจ้าหน้าที่ คุณสามารถยกเลิกคำขอการตรวจสอบได้ตลอดเวลาจากหน้านี้',
    'deleteOverride' => 'ลบข้อมูลที่แทนที่ชื่อของคุณ',
    'deleteOverrideConfirm' => 'คุณแน่ใจหรือไม่ว่าต้องการลบการแทนที่ชื่อเครดิตการแปลของคุณ? ข้อมูลชื่อของคุณจะกลับไปเป็นข้อมูลเริ่มต้นจาก Crowdin',
    'approvedValues' => [
      'displayName' => 'ชื่อ',
      'avatarProvider' => 'ระบบที่จะให้รูปโปรไฟล์',
      'avatarId' => 'ไอดีรูปโปรไฟล์',
      'url' => 'URL ของโปรไฟล์',
      'visible' => 'มองเห็นได้',
      'hidden' => 'ซ่อน',
    ],
  ],
  'deletion' => [
    'heading' => 'การลบบัญชี',
    'description' => 'เมื่อบัญชีของคุณถูกลบ ข้อมูลและทรัพยากรทั้งหมดที่เกี่ยวข้องกับบัญชีนั้นจะถูกลบอย่างถาวร ก่อนที่จะทำการลบบัญชี โปรดดาวน์โหลดข้อมูลหรือรายละเอียดใด ๆ ที่คุณต้องการเก็บไว้ก่อน',
    'deleteButton' => 'ลบบัญชีผู้ใช้',
    'confirmDialog' => [
      'header' => 'คุณแน่ใจหรือไม่ว่าต้องการลบบัญชีของคุณ?',
      'body' => 'เมื่อบัญชีของคุณถูกลบแล้ว ทรัพยากรและข้อมูลทั้งหมดจะถูกลบอย่างถาวร',
    ],
  ],
];
