<?php

return [
  'title' => 'โปรไฟล์',
  'intro' => 'หน้าโปรไฟล์ช่วยให้คุณจัดการข้อมูลบัญชีของคุณที่เกี่ยวข้องกับเว็บไซต์โดยเฉพาะ
หากคุณต้องการเปลี่ยนค่าพื้นฐานหรือการตั้งค่าอื่น ๆ สำหรับแอป Discord โปรดไปที่หน้า <1>การตั้งค่าแอป</1>',
  'information' => [
    'heading' => 'ข้อมูลโปรไฟล์',
    'description' => "อัปเดตข้อมูลโปรไฟล์บัญชีของคุณ",
    'displayName' => 'ชื่อที่ใช้แสดง',
    'saveSuccess' => 'โปรไฟล์ของคุณได้รับการอัปเดตเรียบร้อยแล้ว',
  ],
  'accounts' => [
    'heading' => 'บัญชีที่เชื่อมต่อ',
    'description' => [
      'บัญชี HammerTime จะช่วยให้คุณสามารถเชื่อมโยงหลายบัญชี Discord เข้าด้วยกัน เพื่อให้สามารถจัดการทรัพยากรของแต่ละบัญชีได้จากที่เดียวในอนาคต',
      'ด้านล่างนี้คือรายการบัญชี Discord ทั้งหมดที่เชื่อมโยงกับบัญชี HammerTime นี้',
    ],
    'discord' => 'บัญชี Discord',
    'crowdin' => 'บัญชี Crowdin',
    'noConnectedAccounts' => 'ขณะนี้คุณยังไม่มีบัญชีที่เชื่อมต่ออยู่',
    'linkAdditional' => [
      'heading' => 'ลิงก์หรืออัปเดตบัญชี',
      'description' => 'การเชื่อมโยงหลายบัญชีเข้ากับบัญชี HammerTime จะช่วยให้คุณสามารถจัดการการตั้งค่าของบัญชีทั้งหมดที่เชื่อมต่อไว้ได้จากที่เดียว',
      'discord' => [
        'description' => 'หากรูปโปรไฟล์หรือชื่อที่แสดงของคุณมีการเปลี่ยนแปลง คุณสามารถใช้ฟังก์ชันนี้เพื่ออัปเดตข้อมูลนั้นให้กับบัญชี Discord ใด ๆ ที่เชื่อมโยงไว้แล้วได้เช่นกัน',
        'authorize' => 'อนุญาตบัญชี Discord',
      ],
      'crowdin' => [
        'description' => 'หากคุณเป็นผู้แปลสำหรับโปรเจ็กต์นี้ การเชื่อมโยงบัญชี Crowdin ของคุณจะช่วยให้คุณสามารถปรับแต่งวิธีการแสดงชื่อของคุณในส่วนเครดิตของการแปลได้ในภายหลัง และยังทำหน้าที่เป็นระดับการยืนยันเพิ่มเติม เพื่อยืนยันว่าบัญชีเหล่านี้เป็นของคุณจริง หากคุณเข้าร่วมเซิร์ฟเวอร์ Discord ของโปรเจ็กต์',
        'authorize' => 'อนุญาตบัญชี Crowdin',
      ],
    ],
  ],
  'deletion' => [
    'heading' => 'การลบบัญชี',
    'description' => 'เมื่อบัญชีของคุณถูกลบ ข้อมูลและทรัพยากรทั้งหมดที่เกี่ยวข้องกับบัญชีนั้นจะถูกลบอย่างถาวร ก่อนที่จะทำการลบบัญชี โปรดดาวน์โหลดข้อมูลหรือรายละเอียดใด ๆ ที่คุณต้องการเก็บไว้ก่อน',
    'deleteButton' => 'ลบบัญชีผู้ใช้',
    'confirmDialog' => [
      'header' => 'คุณแน่ใจหรือไม่ว่าต้องการลบบัญชีของคุณ?',
      'body' => 'เมื่อบัญชีของคุณถูกลบแล้ว ทรัพยากรและข้อมูลทั้งหมดจะถูกลบอย่างถาวร',
    ],
  ],
];
