<?php

return [
  'howTo' => 'เลือกวันที่ จากนั้นคัดลอกเวลาที่ต้องการจากคอลัมน์ :syntaxColName แล้ววางที่ใดก็ได้ในข้อความแชท ผลลัพธ์จะเป็นไทม์สแตมป์แบบไดนามิกที่จะแสดงแตกต่างกันสำหรับแต่ละคนตามโซนเวลาของพวกเขาเอง',
  'picker' => [
    'label' => [
      'date' => 'วันที่',
      'time' => 'เวลา',
      'dateAndTime' => 'วันและเวลา',
      'timezone' => 'เขตเวลา',
      'naturalLanguageInput' => '@time input',
      'modeOffset' => 'ค่าความคลาดเคลื่อนสัมบูรณ์',
      'modeZoneName' => 'ชื่อเขต',
    ],
    'button' => [
      'jumpToToday' => 'ไปที่เดือนปัจจุบัน',
    ],
    'tooltip' => [
      'setToCurrent' => 'ตั้งค่าเป็นเวลาปัจจุบัน',
      'lock' => 'ล็อคเวลาโดยใช้ URL',
      'unlock' => 'ปลดล็อควันเวลา',
      'previousYear' => 'ปีที่แล้ว',
      'previousMonth' => 'เดือนที่แล้ว',
      'nextMonth' => 'เดือนถัดไป',
      'nextYear' => 'ปีหน้า',
    ],
    'validation' => [
      'naturalLanguageParseError' => 'Could not parse natural language input'
    ]
  ],
  'table' => [
    'syntaxColumn' => 'ไวยากรณ์ของแชท',
    'resultColumn' => 'ตัวอย่างผลลัพธ์',
  ],
  'usefulLinks' => [
    'lead' => 'คุณอาจจะพบว่าสิ่งพวกนี้มีประโยชน์สำหรับคุณ',
    'server' => [
      'header' => 'เซิร์ฟเวอร์ HammerTime อย่างเป็นทางการ',
      'p' => 'พูดคุยเกี่ยวกับเว็บไซต์ ทดสอบโค้ด หรือ แนะนำฟีเจอร์ใหม่ๆ',
    ],
    'bot' => [
      'header' => 'แอปพลิเคชัน HammerTime',
      'p' => 'สร้างการประทับเวลาภายใน Discord โดยใช้คำสั่งสแลช',
    ],
    'oldSite' => [
      'header' => 'เว็บไซต์ HammerTime เวอร์ชันเก่า',
      'p' => 'เว็บไซต์เวอร์ชันเก่าของโปรเจ็กต์ ซึ่งจะยังคงเปิดให้ใช้งานได้จนกว่าเวอร์ชันเบต้า จะเปิดให้บริการ',
    ],
    'textColor' => [
      'header' => 'Rebane <1>สีสันต่างๆ</1> ตัวสร้างข้อความ',
      'p' => 'แอปแบบง่าย ๆ ที่ใช้สร้างข้อความสีสำหรับ Discord โดยอาศัย รหัสสี ANSI',
    ],
    "subreddit" => [
      "header" => "r/SplitSecond",
      "p" => "ชุมชนที่จัดกิจกรรม ท้าทายประจำสัปดาห์ สำหรับเกมแข่งรถที่ไม่ได้รับความนิยมมากนัก แต่เป็นแรงบันดาลใจในการสร้างโปรเจ็กต์นี้",
    ],
  ],
];
