<?php

return [
  'howTo' => 'เลือกวันที่ จากนั้นคัดลอกเวลาที่ต้องการจากคอลัมน์ :syntaxColName แล้ววางที่ใดก็ได้ในข้อความแชท ผลลัพธ์จะเป็นไทม์สแตมป์แบบไดนามิกที่จะแสดงแตกต่างกันสำหรับแต่ละคนตามโซนเวลาของพวกเขาเอง',
  'picker' => [
    'label' => [
      'date' => 'วันที่',
      'time' => 'เวลา',
      'dateAndTime' => 'วันและเวลา',
      'timezone' => 'เขตเวลา',
      'naturalLanguageInput' => 'ช่องป้อน @time',
      'modeOffset' => 'ส่วนต่างโซนเวลาแบบกำหนดเอง',
      'modeZoneName' => 'ชื่อเขตเวลา',
    ],
    'button' => [
      'jumpToToday' => 'ไปที่เดือนปัจจุบัน',
      'contextRange' => '<0/>–<2/>',
    ],
    'tooltip' => [
      'setToCurrent' => 'ตั้งค่าเป็นเวลาปัจจุบัน',
      'lock' => 'ล็อคเวลาโดยใช้ URL',
      'unlock' => 'ปลดล็อควันเวลา',
      'previousYear' => 'ปีที่แล้ว',
      'previousMonth' => 'เดือนที่แล้ว',
      'previousDecade' => 'ทศวรรษก่อนหน้า',
      'nextMonth' => 'เดือนถัดไป',
      'nextYear' => 'ปีหน้า',
      'nextDecade' => 'ทศวรรษต่อไป',
    ],
    'validation' => [
      'naturalLanguageParseError' => 'ไม่สามารถวิเคราะห์ภาษาธรรมชาตินี้ได้'
    ]
  ],
  'table' => [
    'syntaxColumn' => 'ไวยากรณ์ของแชท',
    'resultColumn' => 'ตัวอย่างผลลัพธ์',
    'editFormats' => 'ปรับแต่งรูปแบบเวลา',
    'resetFormats' => 'ตั้งค่ากลับเป็นค่าเริ่มต้น',
    'hideFormat' => 'ซ่อนรูปแบบเวลานี้',
    'showFormat' => 'แสดงรูปแบบเวลานี้',
    'unhideInProfile' => 'ยกเลิกการซ่อนรูปแบบเวลานี้ในการตั้งค่าโปรไฟล์',
  ],
  'faq' => [
    'title' => 'คำถามที่พบบ่อย',
    'description' => 'ส่วนข้อความนี้จะใช้ภาษาอังกฤษเท่านั้นในตอนนี้ และอิงจากเนื้อหา<1>ในเซิร์ฟเวอร์ Discord ของเรา</1>เป็นอย่างมาก บางลิงก์อาจไม่ทำงานตามที่คาดหวังหากคุณไม่ใช่สมาชิกของเซิร์ฟเวอร์',
  ],
  'usefulLinks' => [
    'lead' => 'คุณอาจจะพบว่าสิ่งพวกนี้มีประโยชน์สำหรับคุณ',
    'server' => [
      'header' => 'เซิร์ฟเวอร์ HammerTime อย่างเป็นทางการ',
      'p' => 'พูดคุยเกี่ยวกับเว็บไซต์ ทดสอบโค้ด หรือ แนะนำฟีเจอร์ใหม่ๆ',
    ],
    'bot' => [
      'header' => 'แอปพลิเคชัน HammerTime',
      'p' => 'สร้างการประทับเวลาภายใน Discord โดยใช้คำสั่งสแลช',
    ],
    'oldSite' => [
      'header' => 'เว็บไซต์ HammerTime เวอร์ชันเก่า',
      'p' => 'เว็บไซต์เวอร์ชันเก่าของโปรเจ็กต์ ซึ่งจะยังคงเปิดให้ใช้งานจนกว่าจะมีการแจ้งให้ทราบ',
    ],
    'textColor' => [
      'header' => 'Rebane <1>สีสันต่างๆ</1> ตัวสร้างข้อความ',
      'p' => 'แอปแบบง่าย ๆ ที่ใช้สร้างข้อความสีสำหรับ Discord โดยอาศัย รหัสสี ANSI',
    ],
    "subreddit" => [
      "p" => "ชุมชนที่จัดกิจกรรม ท้าทายประจำสัปดาห์ สำหรับเกมแข่งรถที่ไม่ได้รับความนิยมมากนัก แต่เป็นแรงบันดาลใจในการสร้างโปรเจ็กต์นี้",
    ],
    'competitors' => [
      'lead' => [
        'p1' => 'คุณรู้หรือไม่ว่า HammerTime ไม่ใช่เครื่องมือเดียวที่ใช้สร้างประทับเวลา',
        'p2' => 'คุณอาจจะต้องการดูตัวสร้างประทับเวลา Discord เพื่อหาสิ่งที่เหมาะสมกับคุณมากที่สุด',
      ],
      '3vfi' => [
        'header' => '',
        'p' => 'เครื่องสร้างเวลาประทับที่ง่ายและรวดเร็วโดย 3ventic',
      ],
      'dabric' => [
        'header' => '',
        'p' => 'ตัวสร้างประทับเวลา Discord ด้วยภาษาธรรมชาติ โดย dabric',
      ],
      'discordtimestampCom' => [
        'p' => 'เครื่องมือสร้างเวลา Discord ฟรีพร้อมรองรับเขตเวลาท้องถิ่น โดย Sellframe Ltd.',
      ],
      'discordtimestampOrg' => [
        'p' => 'เครื่องมือสร้างประทับเวลา Discord และตัวแปลงเวลาโดย DiscordTimestamp.org',
      ],
      'sesh' => [
        'p' => 'สร้างตัวประทับเวลาใน Discord markdown ในระบบจัดตารางเวลาของบอท Sesh โดย Tunks',
      ],
    ],
  ],
];
