<?php

return [
  'heading' => 'Ανάλυση προβολών σελίδας',
  'description' => 'Αυτή η σελίδα περιέχει βασικές αναλυτικές πληροφορίες (τόσο αποθηκευμένες όσο και εμφανιζόμενες χωρίς προσωπικά στοιχεία) των συνολικών προβολών της σελίδας στην εφαρμογή τις τελευταίες 30 ημέρες.',
  'collectionMethod' => 'Τα δεδομένα συλλέγονται από την πλευρά του διακομιστή, με βάση τις απαντήσεις που αποστέλλονται σε ένα περιορισμένο σύνολο σελίδων. Οι προβολές σελίδων καταγράφονται μεμονωμένα, αλλά συγκεντρώνονται καθημερινά από μια διεργασία στο παρασκήνιο.',
  'lastUpdated' => 'Οι πληροφορίες σε αυτή τη σελίδα αποθηκεύονται στην προσωρινή μνήμη για σύντομο χρονικό διάστημα για να μειωθεί ο φόρτος του διακομιστή. Τα δεδομένα που βλέπετε ενημερώθηκαν τελευταία φορά <1/>.',
  'charts' => [
    'dailyTotal' => 'Ημερήσιες Συνολικές Προβολές Σελίδας',
    'breakdown' => 'Ανάλυση Προβολών Σελίδας',
    'byPage' => 'Κατά Σελίδες',
    'byLanguage' => 'Κατά Γλώσσα',
  ],
  'values' => [
    'unknown' => 'Άγνωστο',
  ],
];
