<?php

return [
  'seoDescription' => 'Δημιουργήστε δείκτες χρονοσήμανσης για μηνύματα συνομιλίας Discord',
  'changeLanguage' => 'Αλλαγή γλώσσας',
  "notFound" => [
    "heading" => "Η σελίδα δεν βρέθηκε",
    "content" => "Δεν υπάρχει κάτι να δεις εδώ.",
  ],
  "maintenanceMode" => [
    "heading" => "Λειτουργία Συντήρησης",
    "content" => [
      'pleaseWait' => "Η εφαρμογή αυτή τη στιγμή ενημερώνεται, παρακαλώ προσπαθήστε ξανά σε λίγα δευτερόλεπτα.",
      'joinSupportServer' => "Αν το πρόβλημα επιμένει για περισσότερο από μερικά λεπτά, παρακαλούμε συνδεθείτε στο διακομιστή υποστήριξης Discord και ενημερώστε μας.",
      'contactDeveloper' => "Αν το πρόβλημα επιμένει για περισσότερο από μερικά λεπτά, επικοινωνήστε με τον προγραμματιστή και ενημερώστε τον.",
    ],
    "supportServerButton" => "Διακομιστής Υποστήριξης",
  ],
  'incompleteTranslations' => 'Οι μεταφράσεις είναι ελλιπείς',
  'contributeTranslations' => 'Συνεισφέρετε',
  'copyToClipboard' => 'Αντιγραφή στο πρόχειρο',
  'copiedToClipboard' => 'Αντιγράφηκε στο πρόχειρο!',
  'jsDisabled' => [
    'title' => 'Η JavaScript είναι απαραίτητη',
    'body' => "Ο περιηγητής σας είτε δεν υποστηρίζει JavaScript είτε είναι απενεργοποιημένη αυτή τη στιγμή. Μερικά προγράμματα περιήγησης απενεργοποιούν την JavaScript από προεπιλογή για λόγους ασφαλείας, αλλά είναι απαραίτητη για αυτήν την εφαρμογή. Παρακαλώ ενεργοποιήστε την και ανανεώστε τη σελίδα ή χρησιμοποιήστε διαφορετικό πρόγραμμα περιήγησης.",
  ],
  'nav' => [
    'botSettings' => 'Ρυθμίσεις Εφαρμογής',
    'profile' => 'Προφίλ',
    'legal' => 'Νομικές Πληροφορίες',
  ],
  'sidebar' => [
    'inputSettings' => [
      'title' => 'Ρυθμίσεις εισαγωγής',
      'naturalLanguageInput' => [
        'label' => '@time input field',
        'description' => 'Allow manipulating the selected timestamp with natural language (e.g. “in 5 hours”) via an additional free-text input. Similar to the new Discord @time tag. Only a limited number of languages are supported.',
      ],
      'customDateInput' => [
        'label' => 'Προσαρμοσμένη εισαγωγή ημερομηνίας',
        'description' => "Αντικαταστήστε την προεπιλεγμένη ημερομηνία του προγράμματος περιήγησης με μια προσαρμοσμένη.",
      ],
      'customTimeInput' => [
        'label' => 'Προσαρμοσμένη εισαγωγή ώρας',
        'description' => "Αντικαταστήστε την προεπιλεγμένη ώρας του προγράμματος περιήγησης με μια προσαρμοσμένη. Αυτό είναι ιδιαίτερα χρήσιμο αν έχετε πρόβλημα με την επιλογή της ώρας σε προγράμματα περιήγησης για κινητά τηλέφωνα.",
      ],
      'separateInputs' => [
        'label' => 'Διαχωρισμός εισαγωγών',
        'description' => "Εμφάνιση δύο διαφορετικών εισαγωγών για την ημερομηνία και την ώρα αντί για μια συνδυασμένη (που δεν υποστηρίζεται σε ορισμένα προγράμματα περιήγησης)",
      ],
      'flatUi' => [
        'label' => 'Επιπεδοποίηση διεπαφής',
        'description' => "Απενεργοποίηση εφέ σκίασης και ύψους στις εισόδους και τα κουμπιά",
      ],
    ],
    'timeSync' => [
      'title' => 'Συγχρονισμός Ώρας',
      'status' => [
        'syncing' => 'Το ρολόι του συστήματός σας συγχρονίζεται αυτή τη στιγμή με τους διακομιστές μας, παρακαλώ περιμένετε.',
        'accurate' => 'Το ρολόι του συστήματός σας είναι ακριβές.',
        'potentiallyWrong' => 'Το ρολόι του συστήματός σας μπορεί να είναι λάθος.',
        'value' => 'Η διαφορά μεταξύ της τοπικής ώρας και της ώρας του διακομιστή είναι :offset.',
      ],
      'autoTimeSync' => [
        'label' => 'Εφαρμογή μετατόπισης του χρόνου διακομιστή σε υπολογισμούς (beta)',
        'description' => 'Εάν το ρολόι του συστήματός σας έχει απόκλιση πάνω από :offset σε σχέση με την ώρα του διακομιστή (εξαιρουμένων των διαφορών στη ζώνη ώρας), ορισμένοι υπολογισμοί ώρας θα προσαρμοστούν ώστε να ληφθεί υπόψη αυτό, οπότε οι χρονοσημάνσεις σας θα είναι λιγότερο πιθανό να είναι εσφαλμένες. <1>Αυτό είναι ένα πειραματικό χαρακτηριστικό, χρησιμοποιήστε το με προσοχή!</1> Ο συγχρονισμός γίνεται κατά την πρώτη φόρτωση της σελίδας και αμέσως μετά την ενεργοποίηση της ρύθμισης.',
      ],
      'details' => 'Λεπτομέριες',
      'autoApplyCheckbox' => 'Εφαρμογή υπολογισμού μετατόπισης στη βιβλιοθήκη DateTime όταν πατάτε το :syncButtonLabel χειροκίνητα (εφαρμόζεται μόνο αν η διαφορά είναι πάνω από το όριο :offset)',
      'syncButtonLabel' => 'Συγχρονισμός',
      'resetOffsetButtonLabel' => 'Επαναφορά μετατόπισης',
      'roundTripDuration' => 'Διάρκεια επιστροφής',
      't0' => 'Χρονοσήμανση του χρήστη για τη διαβίβαση του αιτήματος',
      't1' => 'Χρονοσήμανση του διακομιστή για τη λήψη του αιτήματος',
      't2' => 'Χρονοσήμανση του διακομιστή για τη μετάδοση της απόκρισης',
      't3' => 'Χρονοσήμανση του διακομιστή για τη λήψη του αιτήματος',
      'dtlOffsetCell' => 'Ενεργός Υπολογισμός Μετατόπισης',
      'timestampValue' => ':value s',
      'offsetAmount' => ':offset ms',
      'networkOffsetCell' => 'Εντοπίστηκε Μετατόπιση (μέσω Δικτύου)',
    ],
    'localSettings' => [
      'title' => 'Τοπικές Ρυθμίσεις',
    ],
    'credits' => [
      'title' => 'Συντελεστές',
      'developedBy' => 'Δημιουργήθηκε από <1></1>',
      'using' => 'Χρησιμοποιώντας <1></1>',
      'fontAwesomeFree' => 'Δωρεάν έκδοση Font Awesome',
      'laravel' => 'Laravel',
      'vueJs' => 'Vue.js',
      'dateFns' => 'date-fns',
      'vueTippy' => 'VueTippy',
      'chrono' => 'chrono',
      'translatedBy' => 'Μετάφραση από <1></1>',
      'openSourceSoftware' => 'Λογισμικό ανοικτού κώδικα',
      'viewSourceCode' => 'Προβολή πηγαίου κώδικα',
      'notAffiliated' => 'Αυτό το πρότζεκτ δεν σχετίζεται με το Discord.',
    ],
    'themeButton' => [
      'dark' => 'Σκοτεινή λειτουργία',
      'light' => 'Φωτεινή λειτουργία',
      'system' => 'Χρήση Θέματος Συστήματος',
    ],
  ],
  'designEditor' => [
    'title' => 'Σχεδιασμός Επεξεργασίας',
    'description' => 'Μπορείτε να προσαρμόσετε πολλές πτυχές της εμφάνισης της ιστοσελίδας χρησιμοποιώντας τις εισόδους στον παρακάτω πίνακα. Τα ονόματα των μεταβλητών βασίζονται σε αναγνωριστικά του κώδικα και επομένως δεν μπορούν να μεταφραστούν. Οι τιμές θα επανέλθουν κατά την ανανέωση της σελίδας.',
    'designPageLink' => 'Σχεδιασμός Σελίδας',
    'exportInfo' => 'Μπορείτε να εξάγετε τις αλλαγές σας σε ένα αρχείο UserStyle, το οποίο μπορεί να χρησιμοποιηθεί με μια επέκταση όπως η <1>Stylus</1> για να προσαρμόσετε μόνιμα την εμφάνιση της εφαρμογής. Σημειώστε, ωστόσο, ότι αυτές οι μεταβλητές μπορεί να αλλάξουν ανά πάσα στιγμή, απαιτώντας να ενημερώσετε χειροκίνητα τα προσαρμοσμένα στυλ σας.',
    'export' => 'Εξαγωγή ως UserStyle',
    'variableColumnHeader' => 'Μεταβλητή CSS',
    'valueColumnHeader' => 'Τιμή',
  ],
];
