<?php

return [
  'translations' => [
    'title' => 'Μεταφρασμένο Περιεχόμενο',
    'text' => 'Αυτό το έργο περιέχει μεταφράσεις από εθελοντές μεταφραστές και άλλα μέλη της κοινότητας. Αυτές οι μεταφράσεις παρέχονται για την εξυπηρέτηση των χρηστών και ενδέχεται να μην είναι πάντα πλήρως ενημερωμένες. Σε όλα τα θέματα, η <1>πρωτότυπη έκδοση γλώσσας</1> αυτής της σελίδας θεωρείται αποτελεσματική.',
  ],
  'lastUpdated' => 'Τελευταία ενημέρωση: <1/>',
  'privacy' => [
    'heading' => 'Πολιτική Απορρήτου',
    'operator' => '<0/> ("εμάς", "εμείς", "μας", ή "Προγραμματιστής") λειτουργεί η ιστοσελίδα HammerTime (η "Ιστοσελίδα"), και HammerTimeBot (το "Bot", ή "Εφαρμογή"), συλλογικά το Έργο HammerTime (το "Έργο"). Αυτή η σελίδα σας ενημερώνει για τις πολιτικές μας σχετικά με τη συλλογή, χρήση και αποκάλυψη προσωπικών πληροφοριών που λαμβάνουμε από τους χρήστες του Έργου ("εσείς", "Χρήστης", ή συλλογικά "Χρήστες").',
    'notAffiliated' => 'Παρόλο που το όνομα "HammerTime" ("Όνομα Έργου") προέρχεται από την προηγούμενη ονομασία "Hammer & Chisel" της Discord, Inc. ("Discord")<1/> το Έργο δεν συνδέεται με κανέναν τρόπο, σχήμα ή μορφή με το Discord, ούτε με τον M.C. Hammer, στο τραγούδι του οποίου<3/> εμφανίζεται αυτή η φράση σε περίοπτη θέση. Ο Προγραμματιστής δεν κατέχει κανένα εμπορικό σήμα ή πνευματικά δικαιώματα επί του ονόματος του Έργου.',
    'infoCollection' => [
      'heading' => 'Συλλογή & Χρήση Πληροφοριών',
      'pii' => 'Κατά τη χρήση του Έργου δεν σας ζητάμε ούτε σας ενθαρρύνουμε να μας παρέχετε οποιεσδήποτε Προσωπικά Αναγνωρίσιμες Πληροφορίες ("PII", "Προσωπικές Πληροφορίες") που μπορούν να χρησιμοποιηθούν για να σας αναγνωρίσουν ως άτομο. Τα PII μπορεί να περιλαμβάνουν, μεταξύ άλλων: το όνομά σας, την ημερομηνία γέννησης, τους εθνικούς αριθμούς αναγνώρισης, την τοποθεσία, τον αριθμό τηλεφώνου.',
      'auth' => 'Η σύνδεση παρέχεται χρησιμοποιώντας το API OAuth 2 ("API") του Discord, το οποίο ασφαλίζεται επίσης με τη χρήση HTTPS. Κατά τη διαδικασία ελέγχου ταυτότητας OAuth, η Ιστοσελίδα μας δεν λαμβάνει το όνομα χρήστη ή τον κωδικό πρόσβασης, μόνο ένα διακριτικό που μπορεί να χρησιμοποιηθεί για να επαληθεύσει την ταυτότητα του χρήστη χρησιμοποιώντας αυτό το API. Για λόγους απόδοσης αποθηκεύουμε τις βασικές πληροφορίες που παρέχονται από το API (ID χρήστη, τρέχον όνομα χρήστη, εμφάνιση ονόματος, σύνδεση avatar) τοπικά.',
      'removal' => 'Αυτές οι πληροφορίες δεν διαγράφονται αυτόματα από τη βάση δεδομένων μας αν απενεργοποιήσετε το λογαριασμό σας στο Discord, οπότε φροντίστε να επικοινωνήσετε μαζί μας αν θέλετε να αφαιρεθούν τα δεδομένα σας.',
    ],
    'logData' => [
      'heading' => 'Δεδομένα Καταγραφής',
      'browserInfo' => 'Συλλέγουμε πληροφορίες που στέλνει το πρόγραμμα περιήγησής σας κάθε φορά που επισκέπτεστε τον Ιστότοπό μας ("Δεδομένα Καταγραφής"). Αυτά τα Δεδομένα Καταγραφής μπορεί να περιλαμβάνουν πληροφορίες όπως η διεύθυνση IP του υπολογιστή σας, το λειτουργικό σύστημα, ο τύπος του προγράμματος περιήγησης, η έκδοση του προγράμματος περιήγησης, οι σελίδες της Ιστοσελίδας μας που επισκέπτεστε, η ώρα και η ημερομηνία της επίσκεψής σας.',
      'thirdParty' => 'Αυτά τα Δεδομένα Καταγραφής αποθηκεύονται μόνο στον διακομιστή μας και δεν μοιράζονται με κανένα τρίτο μέρος. Τα Δεδομένα Καταγραφής χρησιμοποιούνται για διαγνωστικούς σκοπούς, και μοιράζονται με τις υπηρεσίες επιβολής του νόμου, εάν ζητηθεί ρητά. Διατηρούνται για ένα διάστημα έως 14 ημερών και κατόπιν απορρίπτονται.',
      'debugging' => 'Το Bot μπορεί να λαμβάνει αλληλεπιδράσεις από Χρήστες μέσω του προγράμματος Discord, οι οποίες περιλαμβάνουν εντολές slash και εντολές του μενού περιβάλλοντος ("Ενέργεια", "Εντολή" ή συλλογικά "Εντολές"). Οι εντολές slash μπορούν επιπλέον να εκτελεστούν με δομημένα ζεύγη κλειδιών-τιμών που παρέχονται από τον Χρήστη ("Επιλογές"). Το Bot καταγράφει τις εκτελέσεις Εντολών για σκοπούς εντοπισμού σφαλμάτων, δηλαδή: το όνομα χρήστη Discord και το αναγνωριστικό ("ID") του Χρήστη που εκτέλεσε την Εντολή, το όνομα της Εντολής (συμπεριλαμβανομένων όλων των Επιλογών) και το ID του διακομιστή στον οποίο εκτελέστηκε η Εντολή. Τα δεδομένα αυτά αποθηκεύονται στον διακομιστή του Έργου για έως και 30 ημέρες και είναι προσβάσιμα μόνο από τον Προγραμματιστή.',
      'noPii' => 'Όταν εκτελείτε Εντολές, θα πρέπει να αποφεύγετε να συμπεριλαμβάνετε οποιαδήποτε Προσωπική Πληροφορία. Ορισμένες πληροφορίες ενδέχεται να διατηρηθούν στο Αρχείο καταγραφής της Εφαρμογής μας, γι\' αυτό παρακαλούμε επικοινωνήστε μαζί μας χρησιμοποιώντας τις μεθόδους που περιγράφονται στο τέλος του παρόντος εγγράφου για να μας ενημερώσετε εάν απαιτείται η παρέμβασή μας.',
    ],
    'telemetry' => [
      'heading' => 'Τηλεμετρία & Στατιστικά',
      'statsCollection' => 'Προκειμένου να αξιολογηθεί η χρήση του Bot και να ληφθούν αποφάσεις ανάπτυξης (π.χ. προσθήκη/αφαίρεση λειτουργιών), μπορεί να συλλεχθεί ένα συγκεκριμένο σύνολο δεδομένων σχετικά με τις Εντολές και τη χρήση τους ("Τηλεμετρία"). Οι πληροφορίες τηλεμετρίας περιορίζονται στο ποια εντολή και ποιες επιλογές χρησιμοποιήθηκαν και πότε χρησιμοποιήθηκαν, χωρίς καμία πληροφορία αναγνώρισης (επομένως δεν περιλαμβάνουν ποτέ αναγνωριστικά διακομιστή ή χρήστη, ούτε οποιεσδήποτε τιμές που παρέχονται από τον χρήστη, και είναι πλήρως ανώνυμες). Η τηλεμετρία αποθηκεύεται επ\' αόριστον και τα στατιστικά στοιχεία που προκύπτουν από αυτήν προορίζονται να εμφανίζονται και να κοινοποιούνται δημόσια σε συγκεντρωτική μορφή.',
      'telemetryOptOut' => 'Με τη χρήση του Έργου, οι Χρήστες συμφωνούν με τη συλλογή τηλεμετρίας από προεπιλογή. Εάν ένας Χρήστης επιθυμεί να αποχωρήσει από τη συλλογή Τηλεμετρίας, μπορεί να δηλώσει την προτίμησή του μέσω της κατάλληλης επιλογής στη σελίδα <1/>.',
    ],
    'cookies' => [
      'heading' => 'Cookies',
      'intro' => 'Τα cookies είναι αρχεία με μικρή ποσότητα δεδομένων. Τα cookies αποστέλλονται στο πρόγραμμα περιήγησής σας από μια ιστοσελίδα και αποθηκεύονται στο σκληρό δίσκο του υπολογιστή σας.',
      'disable' => 'Χρησιμοποιούμε "cookies" για να διατηρήσουμε πληροφορίες. Μπορείτε να δώσετε εντολή στο πρόγραμμα περιήγησής σας να αρνηθεί όλα τα cookies ή να υποδείξετε πότε αποστέλλεται ένα cookie. Ωστόσο, αν δεν δέχεστε cookies, ενδέχεται να μην μπορείτε να χρησιμοποιήσετε κάποια τμήματα της ιστοσελίδας μας.',
      'session' => 'Για τους συνδεδεμένους χρήστες χρησιμοποιείται ένα μόνιμο cookie για να θυμάται την κατάσταση σύνδεσης σε όλες τις περιόδους λειτουργίας του προγράμματος περιήγησης για 30 ημέρες. Εάν θέλετε να σταματήσετε να χρησιμοποιείτε το μόνιμο cookie, μπορείτε είτε να αποσυνδεθείτε είτε να διαγράψετε τα cookies που έχουν οριστεί από την Ιστοσελίδα μας.',
    ],
    'security' => [
      'heading' => 'Ασφάλεια',
      'noGuarantee' => 'Η ασφάλεια των Προσωπικών σας Πληροφοριών είναι σημαντική για εμάς, αλλά να θυμάστε ότι καμία μέθοδος μετάδοσης μέσω του Διαδικτύου ή μέθοδος ηλεκτρονικής αποθήκευσης δεν είναι 100% ασφαλής. Αν και προσπαθούμε να χρησιμοποιούμε εμπορικά αποδεκτά μέσα για την προστασία των Προσωπικών σας Πληροφοριών, δεν μπορούμε να εγγυηθούμε την απόλυτη ασφάλειά τους.',
      'httpsCloudFlare' => 'Η Ιστοσελίδα χρησιμοποιεί το πρωτόκολλο HTTPS χρησιμοποιώντας σύγχρονες σουίτες κρυπτογράφησης TLS για την προστασία της ακεραιότητας και την ασφαλή μεταφορά δεδομένων μεταξύ του προγράμματος περιήγησης και της Ιστοσελίδας μας. Ωστόσο, κάνουμε χρήση της υπηρεσίας Reverse Proxy της CloudFlare, που σημαίνει ότι ένα μέρος των δεδομένων που αποστέλλονται στον Ιστότοπό μας περνάει από τους διακομιστές της. Η CloudFlare λειτουργεί βάσει της δικής της <1>Πολιτικής Απορρήτου</1>.',
      'breachNotify' => 'Σε περίπτωση παραβίασης της ασφάλειας, όλοι οι χρήστες θα ειδοποιηθούν εντός 24 ωρών από την ανακάλυψή της μέσω ανακοίνωσης που θα αναρτηθεί σε αυτή την ιστοσελίδα, σε απαντήσεις που θα αναρτηθούν από το Bot και μέσω ανακοίνωσης στον διακομιστή υποστήριξης Discord του Bot.',
    ],
  ],
  'terms' => [
    'heading' => 'Όροι & Προϋποθέσεις',
    'license' => 'Όλος ο πηγαίος κώδικας του Έργου παρέχεται στο GitHub ως έχει, χωρίς καμία εγγύηση ή ευθύνη. Για τους πλήρεις όρους της άδειας χρήσης, ανατρέξτε στην <1>άδεια χρήσης MIT</1>, αντίγραφο της οποίας βρίσκεται σε κάθε repository. Οι όροι που περιγράφονται παρακάτω ισχύουν για την έκδοση του Έργου που φιλοξενείται από τον Προγραμματιστή ("Συνεδρία") και οι περιορισμοί που επιβάλλονται στο πλαίσιο αυτό δεν πρέπει να θεωρούνται περιορισμοί στη χρήση του πηγαίου κώδικα του Έργου.',
    'noAbuse' => 'Δεν πρέπει να ρυθμίσετε αυτοματισμούς για να εκτελέσετε Εντολές μέσω της Συνεδρίας επανειλημμένα. Αυτό το Bot δεν προορίζεται να χρησιμοποιηθεί από αυτοματοποιημένα εργαλεία, όπως άλλα bots, ή οποιοδήποτε άλλο λογισμικό σχεδιασμένο για να μιμηθεί τη νόμιμη δραστηριότητα του χρήστη. Αντί να βασίζεστε στις απαντήσεις του Βot μας για σκοπούς αυτοματοποίησης, ανατρέξτε στην τεκμηρίωση της γλώσσας προγραμματισμού που χρησιμοποιείται από το Βot σας για το πώς να δημιουργήσετε και να χειριστείτε τις χρονοσημάνσεις UNIX.',
    'fuckWeb3' => 'Η εν λόγω Συνεδρία δεν θα χρησιμοποιείται για να βοηθήσει στη διαδικασία εκπαίδευσης γεννητικών μοντέλων ΤΝ, ούτε για να διευκολύνει οποιαδήποτε γεγονότα ή/και συναλλαγές που σχετίζονται με μη ανταλλάξιμα νομίσματα ("NFTs") ή οποιαδήποτε μορφή κρυπτονομίσματος (π.χ. Ethereum, Bitcoin).',
    'accessRevocation' => 'Η πρόσβασή σας στη Συνεδρία μπορεί να ανακληθεί για οποιονδήποτε λόγο (είτε χωρίς λόγο) κατά τη διακριτική ευχέρεια του Προγραμματιστή. Οι λόγοι μπορούν να περιλαμβάνουν, αλλά δεν περιορίζονται σε: παραβίαση αυτών των όρων, σκόπιμη κατάχρηση των χαρακτηριστικών της Συνεδρίας, απειλές βίας κατά του Προγραμματιστή ή οποιουδήποτε από τους συνεισφέροντες του Έργου, χρήση της Συνεδρίας για κακόβουλους σκοπούς.',
  ],
  'changes' => [
    'heading' => 'Τροποποιήσεις & Αναθεωρήσεις',
    'effectiveFrom' => 'Οι Όροι & Προϋποθέσεις και η Πολιτική Απορρήτου, συλλογικά "Έγγραφα", ισχύουν από την τελευταία ημερομηνία ενημέρωσής τους και θα παραμείνουν σε ισχύ, εκτός από τυχόν τροποποιήσεις στις διατάξεις τους στο μέλλον, οι οποίες θα τεθούν σε ισχύ αμέσως μετά την ανάρτησή τους σε αυτή τη σελίδα.',
    'rightToChange' => 'Διατηρούμε το δικαίωμα να ενημερώνουμε ή να τροποποιήσουμε αυτά τα Έγγραφα ανά πάσα στιγμή και θα πρέπει να ελέγχετε αυτή τη σελίδα ανά τακτά χρονικά διαστήματα. Η συνεχιζόμενη χρήση του Έργου από εσάς μετά την ανάρτηση οποιωνδήποτε τροποποιήσεων των Εγγράφων σε αυτή τη σελίδα θα αποτελεί την αναγνώριση των τροποποιήσεων και τη συγκατάθεσή σας να συμμορφωθείτε και να δεσμευτείτε από τα τροποποιημένα Έγγραφα.',
    'willNotify' => 'Εάν κάνουμε οποιεσδήποτε ουσιώδεις τροποποιήσεις σε αυτά τα Έγγραφα, θα σας ειδοποιήσουμε τοποθετώντας μια εμφανή ειδοποίηση στην ιστοσελίδα μας, καθώς και μια ανακοίνωση στον διακομιστή υποστήριξης Discord του Bot.',
  ],
  'contact' => [
    'heading' => 'Επικοινωνία',
    'whereToContact' => 'Αν έχετε οποιεσδήποτε ερωτήσεις σχετικά με αυτά τα Έγγραφα ή θέλετε να ζητήσετε την αφαίρεση οποιουδήποτε PII που αποθηκεύουμε παρακαλούμε επικοινωνήστε μαζί μας μέσω <1>του διακομιστή Discord του Bot</1> ή χρησιμοποιώντας οποιαδήποτε από τις μεθόδους που αναφέρονται στην ιστοσελίδα του <3>Προγραμματιστή</3>.',
  ],
];
