<?php

return [
  'title' => 'Προφίλ',
  'intro' => 'Η σελίδα προφίλ σας επιτρέπει να διαχειρίζεστε τις πληροφορίες του λογαριασμού σας που σχετίζονται με τον ιστότοπο. Αν ψάχνετε πού μπορείτε να αλλάξετε τις προεπιλογές και άλλες ρυθμίσεις για την εφαρμογή Discord, επισκεφθείτε τη σελίδα <1>Ρυθμίσεις εφαρμογής</1>.',
  'information' => [
    'heading' => 'Πληροφορίες Προφίλ',
    'description' => "Ενημερώστε τις πληροφορίες προφίλ του λογαριασμού σας.",
    'displayName' => 'Εμφανιζόμενο Όνομα',
    'saveSuccess' => 'Το προφίλ σας έχει ενημερωθεί με επιτυχία.',
  ],
  'accounts' => [
    'heading' => 'Συνδεδεμένοι Λογαριασμοί',
    'description' => [
      'Ένας λογαριασμός HammerTime θα σας επιτρέψει να συνδέσετε πολλαπλούς λογαριασμούς του Discord για να είστε σε θέση να διαχειριστείτε τις ρυθμίσεις τους από ένα μέρος στο μέλλον.',
      'Παρακάτω μπορείτε να βρείτε μια λίστα με όλους τους λογαριασμούς του Discord που σχετίζονται με αυτόν τον λογαριασμό HammerTime.',
    ],
    'discord' => 'Λογαριασμοί Discord',
    'crowdin' => 'Λογαριασμοί Crowdin',
    'noConnectedAccounts' => 'Δεν έχετε κανέναν λογαριασμό συνδεδεμένο αυτή τη στιγμή',
    'linkAdditional' => [
      'heading' => 'Σύνδεση ή Ενημέρωση Λογαριασμού',
      'description' => 'Συνδέοντας πολλούς λογαριασμούς με έναν ενιαίο λογαριασμό HammerTime, μπορείτε να διαχειρίζεστε τις ρυθμίσεις όλων των συνδεδεμένων λογαριασμών σε ένα μόνο σημείο.',
      'discord' => [
        'description' => 'Αν η εικόνα προφίλ ή το όνομα προφίλ σας έχει αλλάξει, μπορείτε επίσης να χρησιμοποιήσετε αυτό το στοιχείο για να ενημερώσετε τις πληροφορίες αυτές για οποιονδήποτε λογαριασμό Discord που είναι ήδη συνδεδεμένος.',
        'authorize' => 'Εξουσιοδότηση λογαριασμού Discord',
      ],
      'crowdin' => [
        'description' => 'Αν είστε μεταφραστής για το HammerTime, η σύνδεση του λογαριασμού σας στο Crowdin θα σας επιτρέψει να προσαρμόσετε τον τρόπο με τον οποίο εμφανίζεται το όνομά σας στα credits της μετάφρασης, και χρησιμεύει επίσης ως ένα επιπλέον επίπεδο επαλήθευσης ότι αυτοί οι λογαριασμοί σας ανήκουν σε περίπτωση που συμμετάσχετε στον διακομιστή Discord του HammerTime.',
        'authorize' => 'Εξουσιοδότηση λογαριασμού Crowdin',
      ],
    ],
  ],
  'deletion' => [
    'heading' => 'Διαγραφή Λογαριασμού',
    'description' => 'Μόλις διαγραφεί ο λογαριασμός σας, όλες οι ρυθμίσεις και τα δεδομένα του θα διαγραφούν οριστικά. Πριν διαγράψετε το λογαριασμό σας, παρακαλούμε κατεβάστε τυχόν δεδομένα ή πληροφορίες που επιθυμείτε να διατηρήσετε.',
    'deleteButton' => 'Διαγραφή Λογαριασμού',
    'confirmDialog' => [
      'header' => 'Σίγουρα θέλετε να διαγράψετε τον λογαριασμό σας;',
      'body' => 'Μόλις διαγραφεί ο λογαριασμός σας, όλες οι ρυθμίσεις και τα δεδομένα του θα διαγραφούν οριστικά.',
    ],
  ],
];
