<?php

return [
  'title' => 'Προφίλ',
  'intro' => 'Η σελίδα προφίλ σας επιτρέπει να διαχειρίζεστε τις πληροφορίες του λογαριασμού σας που σχετίζονται με τον ιστότοπο. Αν ψάχνετε πού μπορείτε να αλλάξετε τις προεπιλογές και άλλες ρυθμίσεις για την εφαρμογή Discord, επισκεφθείτε τη σελίδα <1>Ρυθμίσεις εφαρμογής</1>.',
  'information' => [
    'heading' => 'Πληροφορίες Προφίλ',
    'description' => "Ενημερώστε τις πληροφορίες προφίλ του λογαριασμού σας.",
    'displayName' => 'Εμφανιζόμενο Όνομα',
    'hiddenFormats' => 'Επιλογή κρυμμένων μορφών χρονοσημάνσεων από τον πίνακα',
    'saveSuccess' => 'Το προφίλ σας έχει ενημερωθεί με επιτυχία.',
  ],
  'accounts' => [
    'heading' => 'Συνδεδεμένοι Λογαριασμοί',
    'description' => 'Μπορείτε να συνδέσετε πολλούς λογαριασμούς στον λογαριασμό σας HammerTime για να μπορείτε να τους διαχειρίζεστε από ένα μέρος. Οι βασικές πληροφορίες χρήστη που εμφανίζονται εδώ ενημερώνονται αυτόματα το πολύ μία φορά την ώρα κατά τη φόρτωση αυτής της σελίδας.',
    'discord' => 'Λογαριασμοί Discord',
    'crowdin' => 'Λογαριασμοί Crowdin',
    'noConnectedAccounts' => 'Δεν έχετε κανέναν λογαριασμό συνδεδεμένο αυτή τη στιγμή',
    'linkAdditional' => [
      'heading' => 'Συνδέστε επιπλέον λογαριασμούς',
      'description' => 'Χρησιμοποιήστε τα παρακάτω κουμπιά για να συνδέσετε επιπλέον λογαριασμούς στον τρέχοντα λογαριασμό σας HammerTime.',
      'discord' => [
        'description' => 'Αν η εικόνα προφίλ ή το όνομα προφίλ σας έχει αλλάξει, μπορείτε επίσης να χρησιμοποιήσετε αυτό το στοιχείο για να ενημερώσετε τις πληροφορίες αυτές για οποιονδήποτε λογαριασμό Discord που είναι ήδη συνδεδεμένος.',
        'authorize' => 'Εξουσιοδότηση λογαριασμού Discord',
      ],
      'crowdin' => [
        'description' => 'Αν είστε μεταφραστής για το HammerTime, η σύνδεση του λογαριασμού σας στο Crowdin θα σας επιτρέψει να προσαρμόσετε τον τρόπο με τον οποίο εμφανίζεται το όνομά σας στα credits της μετάφρασης, και χρησιμεύει επίσης ως ένα επιπλέον επίπεδο επαλήθευσης ότι αυτοί οι λογαριασμοί σας ανήκουν σε περίπτωση που συμμετάσχετε στον διακομιστή Discord του HammerTime.',
        'authorize' => 'Εξουσιοδότηση λογαριασμού Crowdin',
      ],
    ],
  ],
  'creditOverrides' => [
    'heading' => 'Συντελεστές Μετάφρασης',
    'description' => 'Προσαρμόστε τον τρόπο με τον οποίο εμφανίζεστε στους Συντελεστές Μετάφρασης για κάθε γλώσσα όπου είστε συνεισφέρων.',
    'displayName' => 'Εμφανιζόμενο Όνομα',
    'avatarProvider' => 'Εικόνα προφίλ',
    'avatarProviders' => [
        'discord' => 'Discord',
        'gravatar' => 'Gravatar',
        'crowdin' => 'Crowdin',
    ],
    'gravatarEmail' => 'Διεύθυνση E-mail',
    'gravatarDescription' => 'Το <1>Gravatar</1> σας επιτρέπει να χρησιμοποιήσετε ένα ενιαίο avatar σε πολλές ιστοσελίδες που το υποστηρίζουν. Η διεύθυνση e-mail σας θα αποθηκευτεί ως ένα MD5 hash.',
    'avatarAccount' => 'Λογαριασμός',
    'url' => 'Σύνδεσμος',
    'visibility' => 'Ορατότητα',
    'submit' => 'Υποβολή για έγκριση',
    'saveSuccess' => 'Υποβλήθηκε προς έγκριση',
    'saveHideSuccess' => 'Η ορατότητα ενημερώθηκε',
    'cancel' => 'Ακύρωση αλλαγών',
    'statusPrefix' => 'Κατάσταση',
    'status' => [
      'approved' => 'Εγκρίθηκε',
      'inReview' => 'Σε έλεγχο',
      'rejected' => 'Απορρίφθηκε',
    ],
    'currentlyApproved' => 'Τρέχουσες εγκεκριμένες τιμές',
    'reApprovalWarning' => 'Η αλλαγή οτιδήποτε άλλου εκτός από την ορατότητα θα απαιτήσει χειροκίνητη αναθεώρηση. Μπορείτε να ακυρώσετε το αίτημα αναθεώρησης ανά πάσα στιγμή από αυτή τη σελίδα.',
    'deleteOverride' => 'Αφαίρεση Παράκαμψης',
    'deleteOverrideConfirm' => 'Είστε σίγουροι ότι θέλετε να καταργήσετε την παράκαμψη του συντελεστή μετάφρασης; Η καταχώρησή σας θα επανέλθει στις προεπιλεγμένες πληροφορίες από το Crowdin.',
    'approvedValues' => [
      'displayName' => 'Όνομα',
      'avatarProvider' => 'Πάροχος Avatar',
      'avatarId' => 'Avatar ID',
      'url' => 'Σύνδεσμος Προφίλ',
      'visible' => 'Ορατό',
      'hidden' => 'Κρυφό',
    ],
  ],
  'deletion' => [
    'heading' => 'Διαγραφή Λογαριασμού',
    'description' => 'Μόλις διαγραφεί ο λογαριασμός σας, όλες οι ρυθμίσεις και τα δεδομένα του θα διαγραφούν οριστικά. Πριν διαγράψετε το λογαριασμό σας, παρακαλούμε κατεβάστε τυχόν δεδομένα ή πληροφορίες που επιθυμείτε να διατηρήσετε.',
    'deleteButton' => 'Διαγραφή Λογαριασμού',
    'confirmDialog' => [
      'header' => 'Σίγουρα θέλετε να διαγράψετε τον λογαριασμό σας;',
      'body' => 'Μόλις διαγραφεί ο λογαριασμός σας, όλες οι ρυθμίσεις και τα δεδομένα του θα διαγραφούν οριστικά.',
    ],
  ],
];
