<?php

return [
  'title' => 'Προφίλ',
  'intro' => 'Η σελίδα προφίλ σας επιτρέπει να διαχειρίζεστε τις πληροφορίες του λογαριασμού σας που σχετίζονται με τον ιστότοπο. Αν ψάχνετε πού μπορείτε να αλλάξετε τις προεπιλογές και άλλες ρυθμίσεις για την εφαρμογή Discord, επισκεφθείτε τη σελίδα <1>Ρυθμίσεις εφαρμογής</1>.',
  'information' => [
    'heading' => 'Πληροφορίες Προφίλ',
    'description' => "Ενημερώστε τις πληροφορίες προφίλ του λογαριασμού σας.",
    'displayName' => 'Εμφανιζόμενο Όνομα',
    'hiddenFormats' => 'Επιλογή κρυμμένων μορφών χρονοσημάνσεων από τον πίνακα',
    'saveSuccess' => 'Το προφίλ σας έχει ενημερωθεί με επιτυχία.',
  ],
  'accounts' => [
    'heading' => 'Συνδεδεμένοι Λογαριασμοί',
    'description' => 'You can link multiple accounts to your HammerTime account to be able to manage them in one place. The basic user information displayed here is automatically updated at most once an hour when you load this page.',
    'discord' => 'Λογαριασμοί Discord',
    'crowdin' => 'Λογαριασμοί Crowdin',
    'noConnectedAccounts' => 'Δεν έχετε κανέναν λογαριασμό συνδεδεμένο αυτή τη στιγμή',
    'linkAdditional' => [
      'heading' => 'Link Additional Accounts',
      'description' => 'Use the buttons below to connect additional accounts to your current HammerTime account.',
      'discord' => [
        'description' => 'Αν η εικόνα προφίλ ή το όνομα προφίλ σας έχει αλλάξει, μπορείτε επίσης να χρησιμοποιήσετε αυτό το στοιχείο για να ενημερώσετε τις πληροφορίες αυτές για οποιονδήποτε λογαριασμό Discord που είναι ήδη συνδεδεμένος.',
        'authorize' => 'Εξουσιοδότηση λογαριασμού Discord',
      ],
      'crowdin' => [
        'description' => 'Αν είστε μεταφραστής για το HammerTime, η σύνδεση του λογαριασμού σας στο Crowdin θα σας επιτρέψει να προσαρμόσετε τον τρόπο με τον οποίο εμφανίζεται το όνομά σας στα credits της μετάφρασης, και χρησιμεύει επίσης ως ένα επιπλέον επίπεδο επαλήθευσης ότι αυτοί οι λογαριασμοί σας ανήκουν σε περίπτωση που συμμετάσχετε στον διακομιστή Discord του HammerTime.',
        'authorize' => 'Εξουσιοδότηση λογαριασμού Crowdin',
      ],
    ],
  ],
  'deletion' => [
    'heading' => 'Διαγραφή Λογαριασμού',
    'description' => 'Μόλις διαγραφεί ο λογαριασμός σας, όλες οι ρυθμίσεις και τα δεδομένα του θα διαγραφούν οριστικά. Πριν διαγράψετε το λογαριασμό σας, παρακαλούμε κατεβάστε τυχόν δεδομένα ή πληροφορίες που επιθυμείτε να διατηρήσετε.',
    'deleteButton' => 'Διαγραφή Λογαριασμού',
    'confirmDialog' => [
      'header' => 'Σίγουρα θέλετε να διαγράψετε τον λογαριασμό σας;',
      'body' => 'Μόλις διαγραφεί ο λογαριασμός σας, όλες οι ρυθμίσεις και τα δεδομένα του θα διαγραφούν οριστικά.',
    ],
  ],
];
