<?php

return [
  'howTo' => 'Επιλέξτε μια ημερομηνία, αντιγράψτε την επιθυμητή χρονοσήμανση από την στήλη :syntaxColName, και στη συνέχεια επικολλήστε την σε οποιοδήποτε μήνυμα συνομιλίας. Το αποτέλεσμα θα είναι μια δυναμική χρονοσήμανση που εμφανίζεται διαφορετικά για τον καθένα με βάση τη δική του ζώνη ώρας.',
  'picker' => [
    'label' => [
      'date' => 'Ημερομηνία',
      'time' => 'Ώρα',
      'dateAndTime' => 'Ημερομηνία και ώρα',
      'timezone' => 'Ζώνη ώρας',
      'naturalLanguageInput' => '@time πεδίο',
      'modeOffset' => 'Απόλυτη Μετατόπιση',
      'modeZoneName' => 'Όνομα Ζώνης ώρας',
    ],
    'button' => [
      'jumpToToday' => 'Μετάβαση στον τρέχοντα μήνα',
      'contextRange' => '<0/>–<2/>',
    ],
    'tooltip' => [
      'setToCurrent' => 'Ορισμός τρέχουσας ώρας',
      'lock' => 'Κλείδωμα χρονοσήμανσης μέσω URL',
      'unlock' => 'Ξεκλείδωμα χρονοσήμανσης',
      'previousYear' => 'Προηγούμενο έτος',
      'previousMonth' => 'Προηγούμενος μήνας',
      'previousDecade' => 'Προηγούμενη δεκαετία',
      'nextMonth' => 'Επόμενος μήνας',
      'nextYear' => 'Επόμενο έτος',
      'nextDecade' => 'Επόμενη δεκαετία',
    ],
    'validation' => [
      'naturalLanguageParseError' => 'Αδυναμία ανάλυσης εισαγωγής φυσικής γλώσσας'
    ]
  ],
  'table' => [
    'syntaxColumn' => 'Σύνταξη συνομιλίας',
    'resultColumn' => 'Παράδειγμα αποτελέσματος',
    'editFormats' => 'Προσαρμογή δομής πίνακα',
    'resetFormats' => 'Επαναφορά προεπιλογών πίνακα',
    'hideFormat' => 'Απόκρυψη',
    'showFormat' => 'Εμφάνιση',
    'unhideInProfile' => 'Αποκάλυψη στις ρυθμίσεις προφίλ',
  ],
  'faq' => [
    'title' => 'Συχνές Ερωτήσεις',
    'description' => 'Αυτή η ενότητα είναι μόνο στα Αγγλικά προς το παρόν και βασίζεται σε μεγάλο βαθμό στο περιεχόμενο <1>του διακομιστή Discord</1>. Ορισμένοι σύνδεσμοι ενδέχεται να μην λειτουργούν όπως αναμένεται, εκτός αν είστε μέλος.',
  ],
  'usefulLinks' => [
    'lead' => 'Μπορεί επίσης να σας φανούν χρήσιμα:',
    'server' => [
      'header' => 'Επίσημος Σέρβερ HammerTime',
      'p' => 'Συζητήστε για τον ιστότοπο, δοκιμάστε τις εντολές και προτείνετε χαρακτηριστικά',
    ],
    'bot' => [
      'header' => 'Εφαρμογή HammerTime',
      'p' => 'Δημιουργία χρονοσημάνσεων μέσα από το Discord χρησιμοποιώντας εντολές slash',
    ],
    'oldSite' => [
      'header' => 'HammerTime Beta Ιστοσελίδα',
      'p' => 'Η παλιά ιστοσελίδα του project, ακόμα διαθέσιμη μέχρι την επόμενη ειδοποίηση',
    ],
    'textColor' => [
      'header' => 'Δημιουργία <1>Χρωματιστού</1> κειμένου Rebane',
      'p' => 'Μια απλή εφαρμογή που δημιουργεί πολύχρωμα μηνύματα Discord χρησιμοποιώντας χρωματικούς κώδικες ANSI',
    ],
    "subreddit" => [
      "p" => "Η κοινότητα που φιλοξενεί εβδομαδιαίες προκλήσεις για ένα υποτιμημένο παιχνίδι αγώνων που ενέπνευσε τη δημιουργία αυτού του προγράμματος",
    ],
    'competitors' => [
      'lead' => [
        'p1' => 'Γνωρίζατε ότι το HammerTime δεν είναι το μόνο εργαλείο για τη δημιουργία χρονοσημάνσεων;',
        'p2' => 'Ίσως να θέλετε να ελέγξετε αυτές τις άλλες γεννήτριες χρονοσημάνσεων Discord για να βρείτε αυτή που λειτουργεί καλύτερα για εσάς:',
      ],
      '3vfi' => [
        'header' => '',
        'p' => 'Μια απλή και γρήγορη γεννήτρια χρονοσημάνσεων από 3ventic',
      ],
      'dabric' => [
        'header' => '',
        'p' => 'Γεννήτρια χρονοσφραγίδων φυσικής γλώσσας Discord από dabric',
      ],
      'discordtimestampCom' => [
        'p' => 'Δωρεάν γεννήτρια χρονοσφραγίδων Discord με υποστήριξη τοπικής ζώνης ώρας από Sellframe Ltd.',
      ],
      'discordtimestampOrg' => [
        'p' => 'Γεννήτρια χρονοσήμανσης Discord και μετατροπέας χρόνου από DiscordTimestamp.org',
      ],
      'sesh' => [
        'p' => 'Δημιουργήστε χρονοσημάνσεις Discord από το οικοσύστημα του Sesh bot χρονοδρομολόγησης από Tunks',
      ],
    ],
  ],
];
