<?php

return [
  'howTo' => 'Επιλέξτε μια ημερομηνία, αντιγράψτε την επιθυμητή χρονοσήμανση από την στήλη :syntaxColName, και στη συνέχεια επικολλήστε την σε οποιοδήποτε μήνυμα συνομιλίας. Το αποτέλεσμα θα είναι μια δυναμική χρονοσήμανση που εμφανίζεται διαφορετικά για τον καθένα με βάση τη δική του ζώνη ώρας.',
  'picker' => [
    'label' => [
      'date' => 'Ημερομηνία',
      'time' => 'Ώρα',
      'dateAndTime' => 'Ημερομηνία και ώρα',
      'timezone' => 'Ζώνη ώρας',
      'modeOffset' => 'Απόλυτη Μετατόπιση',
      'modeZoneName' => 'Όνομα Ζώνης ώρας',
    ],
    'button' => [
      'jumpToToday' => 'Μετάβαση στον τρέχοντα μήνα',
    ],
    'tooltip' => [
      'setToCurrent' => 'Ορισμός τρέχουσας ώρας',
      'lock' => 'Κλείδωμα χρονοσήμανσης μέσω URL',
      'unlock' => 'Ξεκλείδωμα χρονοσήμανσης',
      'previousYear' => 'Προηγούμενο έτος',
      'previousMonth' => 'Προηγούμενος μήνας',
      'nextMonth' => 'Επόμενος μήνας',
      'nextYear' => 'Επόμενο έτος',
    ],
  ],
  'table' => [
    'syntaxColumn' => 'Σύνταξη συνομιλίας',
    'resultColumn' => 'Παράδειγμα αποτελέσματος',
  ],
  'usefulLinks' => [
    'lead' => 'Μπορεί επίσης να σας φανούν χρήσιμα:',
    'server' => [
      'header' => 'Επίσημος Σέρβερ HammerTime',
      'p' => 'Συζητήστε για τον ιστότοπο, δοκιμάστε τις εντολές και προτείνετε χαρακτηριστικά',
    ],
    'bot' => [
      'header' => 'Εφαρμογή HammerTime',
      'p' => 'Δημιουργία χρονοσημάνσεων μέσα από το Discord χρησιμοποιώντας εντολές slash',
    ],
    'oldSite' => [
      'header' => 'HammerTime Beta Ιστοσελίδα',
      'p' => 'Η παλιά ιστοσελίδα του προγράμματος, ακόμα διαθέσιμη μέχρι η έκδοση Beta να βγει ζωντανά',
    ],
    'textColor' => [
      'header' => 'Δημιουργία <1>Χρωματιστού</1> κειμένου Rebane',
      'p' => 'Μια απλή εφαρμογή που δημιουργεί πολύχρωμα μηνύματα Discord χρησιμοποιώντας χρωματικούς κώδικες ANSI',
    ],
    "subreddit" => [
      "header" => "r/SplitSecond",
      "p" => "Η κοινότητα που φιλοξενεί εβδομαδιαίες προκλήσεις για ένα υποτιμημένο παιχνίδι αγώνων που ενέπνευσε τη δημιουργία αυτού του προγράμματος",
    ],
  ],
];
