<?php

return [
  'heading' => 'Аналітика переглядів сторінок',
  'description' => 'Ця сторінка містить основні аналітичні дані (які зберігаються та показуватися без будь-яких даних, що дозволяють ідентифікувати особу) щодо загальної кількості переглядів сторінок у додатку за останні :days днів.',
  'collectionMethod' => 'Дані збираються на стороні сервера на основі відповідей, надісланих на обмежений набір сторінок. Перегляди сторінок фіксуються окремо, але щодня агрегуються фоновим процесом.',
  'lastUpdated' => 'Інформація на цій сторінці зберігається в кеші протягом короткого періоду, щоб зменшити навантаження на сервер. Дані, які ви бачите, востаннє оновлювалися <1/>.',
  'charts' => [
    'dailyTotal' => 'Daily Total Page Views',
    'breakdown' => 'Розподіл переглядів сторінок',
    'byPage' => 'За сторінками',
    'byLanguage' => 'За мовою',
  ],
  'values' => [
    'unknown' => 'Unknown',
  ],
];
